src/Books Review/Professional Assembly Language/Professional Assembly Language.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Professional Assembly Language
#+OPTIONS: num:nil H:2


* Chapter 1: What Is Assembly Language
** Processor Instructions
The memory bytes that contain the instruction codes are no different
than the bytes that contain the data used by the processor.

To differentiate between data and instruction codes, special pointers
are used to help the processor keep track of where in memory the data
and instruction codes are stored.

** High-Level Languages
*** Types of high-level languages
they all can be classified into two
different categories, based on how they are run on the computer:
+ Compiled languages
+ Interpreted languages
* Chapter 2: The IA-32 Platform
Often, the whole point of using assembly language is to exploit low-
level features of the processor within your application program. Knowing what elements can be
used to assist your programs in gaining the most speed possible can mean the difference between
a fast application and a slow application.

The hardware and instruction code set designed
for the Pentium processors is commonly referred to as the IA-32 platform.

The processor contains the hardware and instruction codes that control the operation of the computer. It
is connected to the other elements of the computer (the memory storage unit, input devices, and output
devices) using three separate buses: a control bus, an address bus, and a data bus.

The main components in the processor are as follows:
+ Control unit
+ Execution unit
+ Registers
+ Flags

** Control unit
  1. Retrieve instructions from memory. 
  2. Decode instructions for operation. 
  3. Retrieve data from memory as needed.
  4. Store the results as necessary.

Because it takes considerably longer to retrieve data from memory
than to process it, a backlog occurs, whereby the processor is continually waiting for instructions and
data to be retrieved from memory. To solve this problem, the concept of prefetching was created.

To incorporate prefetching, a special storage
area is needed on the processor chip itself — one that can be easily accessed by the processor, quicker
than normal memory access. This was solved using pipelining.

The IA-32 platform implements pipelining by utilizing two (or more) layers of cache. The first cache
layer (called L1) attempts to prefetch both instruction code and data from memory as it thinks it will
be needed by the processor. As the instruction pointer moves along in memory, the prefetch algorithm
determines which instruction codes should be read and placed in the cache. In a similar manner, if data
is being processed from memory, the prefetch algorithm attempts to determine what data elements
may be accessed next and also reads them from memory and places them in cache.

Of course, one pitfall to caching instructions and data is that there is no guarantee that the program will
execute instructions in a sequential order.

To help alleviate this problem, a second cache layer was created. The second cache layer (called L2) can
also hold instruction code and data elements, separate from the first cache layer. When the program
logic jumps to a completely different area in memory to execute instructions, the second layer cache can
still hold instructions from the previous instruction location. If the program logic jumps back to the area,
those instructions are still being cached and can be processed almost as quickly as instructions stored in
the first layer cache.

*** Branch prediction unit
While implementing multiple layers of cache is one way to help speed up processing of program logic, it
still does not solve the problem of “jumpy” programs. 

To help solve this problem, the IA-32 platform processors also incorporate branch prediction. Branch pre-
diction uses specialized algorithms to attempt to predict which instruction codes will be needed next
within a program branch.

Special statistical algorithms and analysis are incorporated to determine the most likely path traveled
through the instruction code. Instruction codes along that path are prefetched and loaded into the cache
layers.

The Pentium 4 processor utilizes three techniques to implement branch prediction:
+ Deep branch prediction
+ Dynamic data flow analysis
+ Speculative execution

*** Out-of-order execution engine
This is where instructions are prepared for processing by the execution unit. It contains
several buffers to change the order of instructions within the pipeline to increase the performance of the
control unit. 

Instructions retrieved from the prefetch and decoding pipeline are analyzed and reordered, enabling
them to be executed as quickly as possible. By analyzing a large number of instructions, the out-of-order
execution engine can find independent instructions that can be executed (and their results saved) until
required by the rest of the program. 

** Execution unit
The main function of the processor is to execute instructions.

