public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Professional Assembly Language</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Professional Assembly Language"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-30T22:32+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Professional Assembly Language</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 1: What Is Assembly Language</a>
<ul>
<li><a href="#sec-1-1">Processor Instructions</a></li>
<li><a href="#sec-1-2">High-Level Languages</a></li>
</ul>
</li>
<li><a href="#sec-2">Chapter 2: The IA-32 Platform</a>
<ul>
<li><a href="#sec-2-1">Control unit</a></li>
<li><a href="#sec-2-2">Execution unit</a></li>
<li><a href="#sec-2-3">Registers</a></li>
<li><a href="#sec-2-4">Advanced IA-32 Features</a></li>
</ul>
</li>
<li><a href="#sec-3">Chapter 3: The Tools of the Trade</a>
<ul>
<li><a href="#sec-3-1">The Development Tools</a></li>
<li><a href="#sec-3-2">The GNU Assembler</a></li>
<li><a href="#sec-3-3">The GNU Linker</a></li>
<li><a href="#sec-3-4">The GNU Compiler</a></li>
<li><a href="#sec-3-5">The GNU Objdump Program</a></li>
<li><a href="#sec-3-6">The GNU Profiler Program</a></li>
</ul>
</li>
<li><a href="#sec-4">Chapter 4: A Sample Assembly Language Program</a>
<ul>
<li><a href="#sec-4-1">The Parts of a Program</a></li>
<li><a href="#sec-4-2">Creating a Simple Program</a></li>
<li><a href="#sec-4-3">Linking with C library functions</a></li>
</ul>
</li>
<li><a href="#sec-5">Chapter 5: Moving Data</a>
<ul>
<li><a href="#sec-5-1">Defining Data Elements</a></li>
<li><a href="#sec-5-2">Moving Data Elements</a></li>
<li><a href="#sec-5-3">Conditional Move Instructions</a></li>
<li><a href="#sec-5-4">Exchanging Data</a></li>
<li><a href="#sec-5-5">The Stack</a></li>
</ul>
</li>
<li><a href="#sec-6">Chapter 6: Controlling Execution Flow</a>
<ul>
<li><a href="#sec-6-1">Unconditional Branches</a></li>
<li><a href="#sec-6-2">Conditional Branches</a></li>
<li><a href="#sec-6-3">Loops</a></li>
<li><a href="#sec-6-4">Optimizing Branch Instructions</a></li>
</ul>
</li>
<li><a href="#sec-7">Chapter 7: Using Numbers</a>
<ul>
<li><a href="#sec-7-1">Using Numbers</a></li>
<li><a href="#sec-7-2">Integers</a></li>
<li><a href="#sec-7-3">Binary Coded Decimal</a></li>
<li><a href="#sec-7-4">Floating-Point Numbers</a></li>
</ul>
</li>
<li><a href="#sec-8">Chapter 8: Basic Math Functions</a>
<ul>
<li><a href="#sec-8-1">Integer Arithmetic</a></li>
</ul>
</li>
<li><a href="#sec-9">Chapter 15: Optimizing Routines</a>
<ul>
<li><a href="#sec-9-1">Optimized Compiler Code</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Chapter 1: What Is Assembly Language</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Processor Instructions</h3>
<div class="outline-text-3" id="text-1-1">

<p>The memory bytes that contain the instruction codes are no different
than the bytes that contain the data used by the processor.
</p>
<p>
To differentiate between data and instruction codes, special pointers
are used to help the processor keep track of where in memory the data
and instruction codes are stored.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">High-Level Languages</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li id="sec-1-2-1">Types of high-level languages<br/>
they all can be classified into two
different categories, based on how they are run on the computer:
<ul>
<li>Compiled languages
</li>
<li>Interpreted languages
</li>
</ul>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Chapter 2: The IA-32 Platform</h2>
<div class="outline-text-2" id="text-2">

<p>Often, the whole point of using assembly language is to exploit low-
level features of the processor within your application program. Knowing what elements can be
used to assist your programs in gaining the most speed possible can mean the difference between
a fast application and a slow application.
</p>
<p>
The hardware and instruction code set designed
for the Pentium processors is commonly referred to as the IA-32 platform.
</p>
<p>
The processor contains the hardware and instruction codes that control the operation of the computer. It
is connected to the other elements of the computer (the memory storage unit, input devices, and output
devices) using three separate buses: a control bus, an address bus, and a data bus.
</p>
<p>
The main components in the processor are as follows:
</p><ul>
<li>Control unit
</li>
<li>Execution unit
</li>
<li>Registers
</li>
<li>Flags
</li>
</ul>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Control unit</h3>
<div class="outline-text-3" id="text-2-1">

<ol>
<li>Retrieve instructions from memory. 
</li>
<li>Decode instructions for operation. 
</li>
<li>Retrieve data from memory as needed.
</li>
<li>Store the results as necessary.
</li>
</ol>


<p>
Because it takes considerably longer to retrieve data from memory
than to process it, a backlog occurs, whereby the processor is continually waiting for instructions and
data to be retrieved from memory. To solve this problem, the concept of prefetching was created.
</p>
<p>
To incorporate prefetching, a special storage
area is needed on the processor chip itself — one that can be easily accessed by the processor, quicker
than normal memory access. This was solved using pipelining.
</p>
<p>
The IA-32 platform implements pipelining by utilizing two (or more) layers of cache. The first cache
layer (called L1) attempts to prefetch both instruction code and data from memory as it thinks it will
be needed by the processor. As the instruction pointer moves along in memory, the prefetch algorithm
determines which instruction codes should be read and placed in the cache. In a similar manner, if data
is being processed from memory, the prefetch algorithm attempts to determine what data elements
may be accessed next and also reads them from memory and places them in cache.
</p>
<p>
Of course, one pitfall to caching instructions and data is that there is no guarantee that the program will
execute instructions in a sequential order.
</p>
<p>
To help alleviate this problem, a second cache layer was created. The second cache layer (called L2) can
also hold instruction code and data elements, separate from the first cache layer. When the program
logic jumps to a completely different area in memory to execute instructions, the second layer cache can
still hold instructions from the previous instruction location. If the program logic jumps back to the area,
those instructions are still being cached and can be processed almost as quickly as instructions stored in
the first layer cache.
</p>
<ul>
<li id="sec-2-1-1">Branch prediction unit<br/>
While implementing multiple layers of cache is one way to help speed up processing of program logic, it
still does not solve the problem of “jumpy” programs. 

<p>
To help solve this problem, the IA-32 platform processors also incorporate branch prediction. Branch pre-
diction uses specialized algorithms to attempt to predict which instruction codes will be needed next
within a program branch.
</p>
<p>
Special statistical algorithms and analysis are incorporated to determine the most likely path traveled
through the instruction code. Instruction codes along that path are prefetched and loaded into the cache
layers.
</p>
<p>
The Pentium 4 processor utilizes three techniques to implement branch prediction:
</p><ul>
<li>Deep branch prediction
</li>
<li>Dynamic data flow analysis
</li>
<li>Speculative execution
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-2-1-2">Out-of-order execution engine<br/>
This is where instructions are prepared for processing by the execution unit. It contains
several buffers to change the order of instructions within the pipeline to increase the performance of the
control unit. 

<p>
Instructions retrieved from the prefetch and decoding pipeline are analyzed and reordered, enabling
them to be executed as quickly as possible. By analyzing a large number of instructions, the out-of-order
execution engine can find independent instructions that can be executed (and their results saved) until
required by the rest of the program. 
</p>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Execution unit</h3>
<div class="outline-text-3" id="text-2-2">

<p>The main function of the processor is to execute instructions.
</p>
</div>

</div>
