src/Books Review/Professional Assembly Language/Professional Assembly Language.org
** Registers
To help solve this problem, the processor includes internal memory locations, called registers. The regis-
ters are capable of storing data elements for processing without having to access the memory storage
unit. The downside to registers is that a limited number of them are built into the processor chip.

The core groups of registers available to all processors in the IA-32
family are shown in the following table.

+ General purpose Eight 32-bit registers used for storing working data
+ Segment Six 16-bit registers used for handling memory access
+ Instruction pointer A single 32-bit register pointing to the next
  instruction code to execute
+ Floating-point data Eight 80-bit registers used for floating-point arithmetic data
+ Control Five 32-bit registers used to determine the operating mode
  of the processor
+ Debug Eight 32-bit registers used to contain information when
  debugging the processor

*** General-purpose registers
The general-purpose registers are used to temporarily store data as it
is processed on the processor.

*** Segment registers
The segment registers are used specifically for referencing memory locations. The IA-32 processor plat-
form allows three different methods of accessing system memory:
+ Flat memory model
+ Segmented memory model
+ Real-address mode

The flat memory model presents all system memory as a contiguous address space. All instructions,
data, and the stack are contained in the same address space. Each memory location is accessed by a spe-
cific address, called a linear address.

The segmented memory model divides the system memory into groups of independent segments, refer-
enced by pointers located in the segment registers. Each segment is used to contain a specific type of
data. One segment is used to contain instruction codes, another data elements, and a third the program
stack.

Memory locations in segments are defined by logical addresses. A logical address consists of a segment
address and an offset address. The processor translates a logical address to a corresponding linear
address location to access the byte of memory.

If a program is using the real address mode, all of the segment registers point to the zero linear address,
and are not changed by the program. All instruction codes, data elements, and stack elements are
accessed directly by their linear address.


















*** Instruction pointer register
The instruction pointer register (or EIP register), sometimes called the program counter, keeps track of the
next instruction code to execute
*** Control registers
The five control registers are used to determine the operating mode of the processor, and the characteris-
tics of the currently executing task
*** Flags
For each operation that is performed in the processor, there must be a mechanism to determine whether
the operation was successful or not.


** Advanced IA-32 Features
*** The x87 floating-point unit
o support these functions, additional instruction codes as
well as additional registers and execution units were required. Together these elements are referred to as
the x87 floating-point unit (FPU).
*** Multimedia extensions (MMX)
MMX was the first technology to support the Intel Single Instruction, Multiple
Data (SIMD) execution model.

The SIMD model was developed to process larger numbers, commonly found in multimedia applica-
tions. The SIMD model uses expanded register sizes and new number formats to speed up the complex
number crunching required for real-time multimedia presentations.

The MMX environment includes three new floating-point data types that can be handled by the
processor:
❑ 64-bit packed byte integers
❑ 64-bit packed word integers
❑ 64-bit packed doubleword integers
*** Streaming SIMD extensions (SSE)
SSE enhances performance for complex floating-point arithmetic, often used in 3-D graphics, motion video,
and video conferencing.

The second implementation of SSE (SSE2) in the Pentium 4 processors incorporates the same XMM reg-
isters that SSE uses, and also introduces five new data types:
❑ 128-bit packed double-precision floating point
❑ 128-bit packed byte integers
❑ 128-bit packed word integers
❑ 128-bit packed doubleword integers
❑ 128-bit packed quadword integers

A third implementation of SSE (SSE3) does not create any new data types, but provides several new
instructions for processing both integer and floating-point values in the XMM registers.



*** Hyperthreading
One of the most exciting features added to the Pentium 4 processor line is hyperthreading. Hyperthreading
enables a single IA-32 processor to handle multiple program execution threads simultaneously.

* Chapter 3: The Tools of the Trade
** The Development Tools
*** The assembler
**** HLA
The High Level Assembler (HLA) is the creation of Professor Randall Hyde. It creates Intel instruction
code applications on DOS, Windows, and Linux operating systems.

The HLA Web site is located at http://webster.cs.ucr.edu. Professor Hyde uses this Web site as a
clearinghouse for various assembler information.



*** The linker
However, most assemblers do not automatically link the object code to produce the executable program
file. Instead, a second manual step is required to link the assembly language object code with other
libraries and produce an executable program file that can be run on the host operating system. This is
the job of the linker.
*** The debugger
Similar to assemblers, debuggers are specific to the operating system and hardware platform for which
the program was written. The debugger must know the instruction code set of the hardware platform,
and understand the registers and memory handling methods of the operating system.

Most debuggers provide four basic functions to the programmer:
+ Running the program in a controlled environment, specifying any runtime parameters required
+ Stopping the program at any point within the program
+ Examining data elements, such as memory locations and registers
+ Changing elements in the program while it is running, to facilitate
  bug removal
*** The compiler
*** The object code disassembler
The GNU compiler enables you to view the generated assembly
language code before it is assembled, but what about after the object file is already created?

A disassembler program takes either a full executable program or an object code file and displays the
instruction codes that will be run by the processor. Some disassemblers even take the process one step
further by converting the instruction codes into easily readable assembly language syntax.
*** The profiler
To determine how much processing time each function is taking, you must have a profiler in your
toolkit. The profiler is able to track how much processor time is spent in each function as it is used dur-
ing the course of the program execution.







** The GNU Assembler
The GNU assembler program (called gas) is the most popular assembler for the UNIX environment.
*** Using the assembler
 One oddity about the assembler is that
although it is called gas, the command-line executable program is called as.
