src/Books Review/Professional Assembly Language/Professional Assembly Language.org
*** A word about opcode syntax
One of the more confusing parts of the GNU assembler is the syntax it uses for representing assembly
language code in the source code file. The original developers of gas chose to implement AT&T opcode
syntax for the assembler.


** The GNU Linker
The GNU linker, ld, is used to link object code files into either
executable program files or library files.
** The GNU Compiler
The GNU Compiler Collection (gcc) is the most popular development system for UNIX systems.
** The GNU Objdump Program
The GNU objdump program is another utility found in the binutils package that can be of great use to
programmers. Often it is necessary to view the instruction codes generated by the compiler in the object
code files. The objdump program will display not only the assembly language code, but the raw instruc-
tion codes generated as well.
** The GNU Profiler Program
The GNU profiler (gprof) is another program included in the binutils package. This program is used
to analyze program execution and determine where “hot spots” are in the application.


* Chapter 4: A Sample Assembly Language Program
** The Parts of a Program
The three most commonly used sections
are as follows:
❑ The data section
❑ The bss section
❑ The text section
*** Defining sections
#+begin_src sh
.section .data
.section .bss
.section .text
#+end_src
*** Defining the starting point
To solve this problem, the GNU assembler declares a default label, or identifier, that should be used for
the entry point of the application. The _start label is used to indicate the instruction from which the
program should start running. 

Besides declaring the starting label in the application, you also need to make the entry point available
for external applications. This is done with the .globl directive.

The .globl directive declares program labels that are accessible from external programs. If you are writ-
ing a bunch of utilities that are being used by external assembly or C language programs, each function
section label should be declared with a .globl directive.

#+begin_src sh
.section.data
<
initialized data here>
.section .bss
< uninitialized data here>
.section .text
.globl _start
_start:
<instruction code goes here>
#+end_src
** Creating a Simple Program
This process replaces the x’s that were used as
placeholders with the actual Vendor ID string pieces (note that the Vendor ID string was divided into the
registers in the strange order EBX, EDX, and ECX)

The Linux write system call is used to write bytes to a file. Following are the parameters for the write
system call:
❑ EAX contains the system call value.
❑ EBX contains the file descriptor to write to.
❑ ECX contains the start of the string.
❑ EDX contains the length of the string

*** Building the executable
#+begin_src sh
$ as -o cpuid.o cpuid.s
$ ld -o cpuid cpuid.o

#or change _start to main
$ gcc -o cpuid cpuid.s

#debug
$ as -gstabs -o cpuid.o cpuid.s
$ ld -o cpuid cpuid.o
#+end_src
** Linking with C library functions
#+begin_src sh
$ ld -dynamic-linker /lib/ld-linux.so.2 -o cpuid2 -lc cpuid2.o
#+end_src

* Chapter 5: Moving Data
** Defining Data Elements
*** The data section
The following table shows the different directives that can be used to
reserve memory for specific types of data elements.
#+begin_src sh
.ascii Text string
.asciz Null-terminated text string
.byte Byte value
.double Double-precision floating-point number
.float Single-precision floating-point number
.int 32-bit integer number
.long 32-bit integer number (same as .int)
.octa 16-byte integer number
.quad 8-byte integer number
.short 16-bit integer number
.single Single-precision floating-point number (same as .float)
#+end_src
After the directive is declared, a default value (or values) must be defined. This sets the data in the
reserved memory location to the specific values.
#+begin_src sh
output:
.ascii “The processor Vendor ID is ‘xxxxxxxxxxxx’\n”
#+end_src
*** Defining static symbols
 The .equ directive is used to set a constant value to a symbol that can be used
in the text section, as shown in the following examples:
#+begin_src sh
.equ factor, 3
.equ LINUX_SYS_CALL, 0x80
#+end_src
*** The bss section
Instead of declaring specific data types, you just declare raw segments of memory that are reserved for
whatever purpose you need them for.
#+begin_src sh
.comm Declares a common memory area for data that is not initialized
.lcomm Declares a local common memory area for data that is not initialized
#+end_src
While the two sections work similarly, the local common memory area is reserved for data that will not
be accessed outside of the local assembly code. The format for both of these directives is
=.comm symbol, length=

#+begin_src sh
.section .bss
.lcomm buffer, 10000
#+end_src
** Moving Data Elements
*** The MOV instruction formats
=movx source, destination=

#+begin_src sh
where x can be the following:
❑ l for a 32-bit long word value
❑ w for a 16-bit word value
❑ b for an 8-bit byte value
#+end_src
*** Moving immediate data to registers and memory
#+begin_src sh
movl $0, %eax
movl $0x80, %ebx
movl $100, height
# moves the value 0 to the EAX register
# moves the hexadecimal value 80 to the EBX register
# moves the value 100 to the height memory location
#+end_src
*** Moving data between registers
#+begin_src sh
movl %eax, %ecx
movw %ax, %cx
# move 32-bits of data from the EAX register to the ECX register
# move 16-bits of data from the AX register to the CX register
#+end_src
*** Moving data between memory and registers
**** Moving data values from memory to a register
=movl value, %eax=
**** Moving data values from a register to memory
=movl %ecx, value=
**** Using indexed memory locations
The way this is done is called indexed memory mode. The memory location is determined by the
following:
+ A base address
+ An offset address to add to the base address
+ The size of the data element
+ An index to determine which data element to select

The format of the expression is
=base_address(offset_address, index, size)=
The data value retrieved is located at
=base_address + offset_address + index * size=

