public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-3-2-2">A word about opcode syntax<br/>
One of the more confusing parts of the GNU assembler is the syntax it uses for representing assembly
language code in the source code file. The original developers of gas chose to implement AT&amp;T opcode
syntax for the assembler.


</li>
</ul>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">The GNU Linker</h3>
<div class="outline-text-3" id="text-3-3">

<p>The GNU linker, ld, is used to link object code files into either
executable program files or library files.
</p></div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">The GNU Compiler</h3>
<div class="outline-text-3" id="text-3-4">

<p>The GNU Compiler Collection (gcc) is the most popular development system for UNIX systems.
</p></div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">The GNU Objdump Program</h3>
<div class="outline-text-3" id="text-3-5">

<p>The GNU objdump program is another utility found in the binutils package that can be of great use to
programmers. Often it is necessary to view the instruction codes generated by the compiler in the object
code files. The objdump program will display not only the assembly language code, but the raw instruc-
tion codes generated as well.
</p></div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">The GNU Profiler Program</h3>
<div class="outline-text-3" id="text-3-6">

<p>The GNU profiler (gprof) is another program included in the binutils package. This program is used
to analyze program execution and determine where “hot spots” are in the application.
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 4: A Sample Assembly Language Program</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">The Parts of a Program</h3>
<div class="outline-text-3" id="text-4-1">

<p>The three most commonly used sections
are as follows:
❑ The data section
❑ The bss section
❑ The text section
</p><ul>
<li id="sec-4-1-1">Defining sections<br/>



<pre class="src src-sh">.section .data
.section .bss
.section .text
</pre>

</li>
</ul>
<ul>
<li id="sec-4-1-2">Defining the starting point<br/>
To solve this problem, the GNU assembler declares a default label, or identifier, that should be used for
the entry point of the application. The <sub>start</sub> label is used to indicate the instruction from which the
program should start running. 

<p>
Besides declaring the starting label in the application, you also need to make the entry point available
for external applications. This is done with the .globl directive.
</p>
<p>
The .globl directive declares program labels that are accessible from external programs. If you are writ-
ing a bunch of utilities that are being used by external assembly or C language programs, each function
section label should be declared with a .globl directive.
</p>



<pre class="src src-sh">.section.data
&lt;
initialized data here&gt;
.section .bss
&lt; uninitialized data here&gt;
.section .text
.globl _start
_start:
&lt;instruction code goes here&gt;
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Creating a Simple Program</h3>
<div class="outline-text-3" id="text-4-2">

<p>This process replaces the x’s that were used as
placeholders with the actual Vendor ID string pieces (note that the Vendor ID string was divided into the
registers in the strange order EBX, EDX, and ECX)
</p>
<p>
The Linux write system call is used to write bytes to a file. Following are the parameters for the write
system call:
❑ EAX contains the system call value.
❑ EBX contains the file descriptor to write to.
❑ ECX contains the start of the string.
❑ EDX contains the length of the string
</p>
<ul>
<li id="sec-4-2-1">Building the executable<br/>



<pre class="src src-sh">$ as -o cpuid.o cpuid.s
$ ld -o cpuid cpuid.o

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">or change _start to main</span>
$ gcc -o cpuid cpuid.s

<span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">debug</span>
$ as -gstabs -o cpuid.o cpuid.s
$ ld -o cpuid cpuid.o
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Linking with C library functions</h3>
<div class="outline-text-3" id="text-4-3">




<pre class="src src-sh">$ ld -dynamic-linker /lib/ld-linux.so.2 -o cpuid2 -lc cpuid2.o
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Chapter 5: Moving Data</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">Defining Data Elements</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li id="sec-5-1-1">The data section<br/>
The following table shows the different directives that can be used to
reserve memory for specific types of data elements.



<pre class="src src-sh">.ascii Text string
.asciz Null-terminated text string
.byte Byte value
.double Double-precision floating-point number
.float Single-precision floating-point number
.int 32-bit integer number
.long 32-bit integer number (same as .int)
.octa 16-byte integer number
.quad 8-byte integer number
.short 16-bit integer number
.single Single-precision floating-point number (same as .float)
</pre>

<p>
After the directive is declared, a default value (or values) must be defined. This sets the data in the
reserved memory location to the specific values.
</p>


<pre class="src src-sh">output:
.ascii &#8220;The processor Vendor ID is &#8216;xxxxxxxxxxxx&#8217;\n&#8221;
</pre>

</li>
</ul>
<ul>
<li id="sec-5-1-2">Defining static symbols<br/>
 The .equ directive is used to set a constant value to a symbol that can be used
in the text section, as shown in the following examples:



<pre class="src src-sh">.equ factor, 3
.equ LINUX_SYS_CALL, 0x80
</pre>

</li>
</ul>
<ul>
<li id="sec-5-1-3">The bss section<br/>
Instead of declaring specific data types, you just declare raw segments of memory that are reserved for
whatever purpose you need them for.



<pre class="src src-sh">.comm Declares a common memory area for data that is not initialized
.lcomm Declares a local common memory area for data that is not initialized
</pre>

<p>
While the two sections work similarly, the local common memory area is reserved for data that will not
be accessed outside of the local assembly code. The format for both of these directives is
<code>.comm symbol, length</code>
</p>



<pre class="src src-sh">.section .bss
.lcomm buffer, 10000
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">Moving Data Elements</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li id="sec-5-2-1">The MOV instruction formats<br/>
<code>movx source, destination</code>




<pre class="src src-sh">where x can be the following:
&#10065; l for a 32-bit long word value
&#10065; w for a 16-bit word value
&#10065; b for an 8-bit byte value
</pre>

</li>
</ul>
<ul>
<li id="sec-5-2-2">Moving immediate data to registers and memory<br/>



<pre class="src src-sh">movl $<span style="color: #eedd82;">0</span>, %eax
movl $<span style="color: #eedd82;">0</span>x80, %ebx
movl $<span style="color: #eedd82;">100</span>, height
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">moves the value 0 to the EAX register</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">moves the hexadecimal value 80 to the EBX register</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">moves the value 100 to the height memory location</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-5-2-3">Moving data between registers<br/>



<pre class="src src-sh">movl %eax, %ecx
movw %ax, %cx
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">move 32-bits of data from the EAX register to the ECX register</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">move 16-bits of data from the AX register to the CX register</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-5-2-4">Moving data between memory and registers<br/>
<ul>
<li id="sec-5-2-4-1">Moving data values from memory to a register<br/>
<code>movl value, %eax</code>
</li>
</ul>
<ul>
<li id="sec-5-2-4-2">Moving data values from a register to memory<br/>
<code>movl %ecx, value</code>
</li>
</ul>
<ul>
<li id="sec-5-2-4-3">Using indexed memory locations<br/>
The way this is done is called indexed memory mode. The memory location is determined by the
following:
<ul>
<li>A base address
</li>
<li>An offset address to add to the base address
</li>
<li>The size of the data element
</li>
<li>An index to determine which data element to select
</li>
</ul>


<p>
The format of the expression is
<code>base_address(offset_address, index, size)</code>
The data value retrieved is located at
<code>base_address + offset_address + index * size</code>
</p>
</li>
</ul>
<ul>
