src/Books Review/Professional Assembly Language/Professional Assembly Language.org
**** Using indirect addressing with registers
Besides holding data, registers can also be used to hold memory addresses. When a register holds a
memory address, it is referred to as a pointer. Accessing the data stored in the memory location using
the pointer is called indirect addressing.

While using a label references the data value contained in the memory location, you can get the memory
location address of the data value by placing a dollar sign ($) in front of the label in the instruction. Thus
the instruction
=movl $values, %edi=

The next instruction in the cpuid.s program:
=movl %ebx, (%edi)=
is the other half of the indirect addressing mode. Without the parentheses around the EDI register, the
instruction would just load the value in the EBX register to the EDI register. With the parentheses around
the EDI register, the instruction instead moves the value in the EBX register to the memory location con-
tained in the EDI register.

Instead of just allowing you to add a value to the register, you must place the value outside of the paren-
theses, like so:

=movl %edx, 4(%edi)=
This instruction places the value contained in the EDX register in the memory location 4 bytes after the
location pointed to by the EDI register. You can also go in the opposite direction:

=movl %edx, -4(&edi)=
This instruction places the value in the memory location 4 bytes before the location pointed to by the
EDI register.






** Conditional Move Instructions
The conditional move instructions are one of those tweaks, available starting in the P6
family of Pentium processors

=cmovx source, destination=

where x is a one- or two-letter code denoting the condition that will trigger the move action. The condi-
tions are based on the current values in the EFLAGS register. The
specific bits that are used by the conditional move instructions are
shown in the following table.

#+begin_src sh
CF Carry flag A mathematical expression has created a carry or borrow
OF Overflow flag An integer value is either too large or too small
PF Parity flag The register contains corrupt data from a mathematical operation
SF Sign flag Indicates whether the result is negative or positive
ZF Zero flag The result of the mathematical operation is zero
#+end_src

The following table shows the unsigned conditional move instructions.
#+begin_src sh
CMOVA/CMOVNBE Above/not below or equal (CF or ZF) = 0
CMOVAE/CMOVNB Above or equal/not below CF=0
CMOVNC Not carry CF=0
CMOVB/CMOVNAE Below/not above or equal CF=1
CMOVC Carry CF=1
CMOVBE/CMOVNA Below or equal/not above (CF or ZF) = 1
CMOVE/CMOVZ Equal/zero ZF=1
CMOVNE/CMOVNZ Not equal/not zero ZF=0
CMOVP/CMOVPE Parity/parity even PF=1
CMOVNP/CMOVPO Not parity/parity odd PF=0
#+end_src

** Exchanging Data
The instructions are described in the following table.
#+begin_src sh
XCHG Exchanges the values of two registers, or a register and a memory location
BSWAP Reverses the byte order in a 32-bit register
XADD Exchanges two values and stores the sum in the destination operand
CMPXCHG Compares a value with an external value and exchanges it with another
CMPXCHG8B Compares two 64-bit values and exchanges it with another
#+end_src

** The Stack
*** How the stack works
The stack behaves just the opposite. The stack is reserved at the end of the memory area, and as data is
placed on the stack, it grows downward. 
*** PUSHing and POPing all the registers
#+begin_src sh
PUSHA/POPA Push or pop all of the 16-bit general-purpose registers
PUSHAD/POPAD Push or pop all of the 32-bit general-purpose registers
PUSHF/POPF Push or pop the lower 16 bits of the EFLAGS register
PUSHFD/POPFD Push or pop the entire 32 bits of the EFLAGS register
#+end_src
*** Optimizing Memor y Access
To solve this problem, Intel suggests following these rules when defining data:

+ Align 16-bit data on a 16-byte boundary.
+ Align 32-bit data so that its base address is a multiple of four.
+ Align 64-bit data so that its base address is a multiple of eight.
+ Avoid many small data transfers. Instead, use a single large data transfer.
+ Avoid using larger data sizes (such as 80- and 128-bit
  floating-point values) in the stack




* Chapter 6: Controlling Execution Flow
** Unconditional Branches
When an unconditional branch is encountered in the program, the instruction pointer is automatically
routed to a different location. You can use three types of unconditional branches:
❑ Jumps
❑ Calls
❑ Interrupts
** Conditional Branches
The result of the conditional
branch depends on the state of the EFLAGS register at the time the branch is executed.

There are many bits in the EFLAGS register, but the conditional branches are only concerned with five
of them:
❑ Carry flag (CF) - bit 0 (lease significant bit)
❑ Overflow flag (OF) - bit 11
❑ Parity flag (PF) - bit 2
❑ Sign flag (SF) - bit 7
❑ Zero flag (ZF) - bit 6

The following table describes all of the conditional jump instructions
available.
#+begin_src sh
JA Jump if above CF=0 and ZF=0
JAE Jump if above or equal CF=0
JB Jump if below CF=1
JBE Jump if below or equal CF=1 or ZF=1
JC Jump if carry CF=1
JCXZ Jump if CX register is 0 JECXZ Jump if ECX register is 0 JE Jump if equal ZF=1
JG Jump if greater ZF=0 and SF=OF
JGE Jump if greater or equal SF=OF
JL Jump if less SF<>OF
JLE Jump if less or equal ZF=1 or SF<>OF
JNA Jump if not above CF=1 or ZF=1
JNAE Jump if not above or equal CF=1
JNB Jump if not below CF=0
JNBE Jump if not below or equal CF=0 and ZF=0
JNC Jump if not carry CF=0
JNE Jump if not equal ZF=0
JNG Jump if not greater ZF=1 or SF<>OF
JNGE Jump if not greater or equal SF<>OF
JNL Jump if not less SF=OF
JNLE Jump if not less or equal ZF=0 and SF=OF
JNO Jump if not overflow OF=0
JNP Jump if not parity PF=0
JNS Jump if not sign SF=0
JNZ Jump if not zero ZF=0
JO Jump if overflow OF=1
JP Jump if parity PF=1
JPE Jump if parity even PF=1
JPO Jump if parity odd PF=0
JS Jump if sign SF=1
JZ Jump if zero ZF=1
#+end_src
