public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-5-2-4-4">Using indirect addressing with registers<br/>
Besides holding data, registers can also be used to hold memory addresses. When a register holds a
memory address, it is referred to as a pointer. Accessing the data stored in the memory location using
the pointer is called indirect addressing.

<p>
While using a label references the data value contained in the memory location, you can get the memory
location address of the data value by placing a dollar sign ($) in front of the label in the instruction. Thus
the instruction
<code>movl $values, %edi</code>
</p>
<p>
The next instruction in the cpuid.s program:
<code>movl %ebx, (%edi)</code>
is the other half of the indirect addressing mode. Without the parentheses around the EDI register, the
instruction would just load the value in the EBX register to the EDI register. With the parentheses around
the EDI register, the instruction instead moves the value in the EBX register to the memory location con-
tained in the EDI register.
</p>
<p>
Instead of just allowing you to add a value to the register, you must place the value outside of the paren-
theses, like so:
</p>
<p>
<code>movl %edx, 4(%edi)</code>
This instruction places the value contained in the EDX register in the memory location 4 bytes after the
location pointed to by the EDI register. You can also go in the opposite direction:
</p>
<p>
<code>movl %edx, -4(&amp;edi)</code>
This instruction places the value in the memory location 4 bytes before the location pointed to by the
EDI register.
</p>





</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">Conditional Move Instructions</h3>
<div class="outline-text-3" id="text-5-3">

<p>The conditional move instructions are one of those tweaks, available starting in the P6
family of Pentium processors
</p>
<p>
<code>cmovx source, destination</code>
</p>
<p>
where x is a one- or two-letter code denoting the condition that will trigger the move action. The condi-
tions are based on the current values in the EFLAGS register. The
specific bits that are used by the conditional move instructions are
shown in the following table.
</p>



<pre class="src src-sh">CF Carry flag A mathematical expression has created a carry or borrow
OF Overflow flag An integer value is either too large or too small
PF Parity flag The register contains corrupt data from a mathematical operation
SF Sign flag Indicates whether the result is negative or positive
ZF Zero flag The result of the mathematical operation is zero
</pre>


<p>
The following table shows the unsigned conditional move instructions.
</p>


<pre class="src src-sh">CMOVA/CMOVNBE Above/not below or equal (CF or ZF) = 0
CMOVAE/CMOVNB Above or equal/not below <span style="color: #eedd82;">CF</span>=0
CMOVNC Not carry <span style="color: #eedd82;">CF</span>=0
CMOVB/CMOVNAE Below/not above or equal <span style="color: #eedd82;">CF</span>=1
CMOVC Carry <span style="color: #eedd82;">CF</span>=1
CMOVBE/CMOVNA Below or equal/not above (CF or ZF) = 1
CMOVE/CMOVZ Equal/zero <span style="color: #eedd82;">ZF</span>=1
CMOVNE/CMOVNZ Not equal/not zero <span style="color: #eedd82;">ZF</span>=0
CMOVP/CMOVPE Parity/parity even <span style="color: #eedd82;">PF</span>=1
CMOVNP/CMOVPO Not parity/parity odd <span style="color: #eedd82;">PF</span>=0
</pre>


</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4">Exchanging Data</h3>
<div class="outline-text-3" id="text-5-4">

<p>The instructions are described in the following table.
</p>


<pre class="src src-sh">XCHG Exchanges the values of two registers, or a register and a memory location
BSWAP Reverses the byte order<span style="color: #00ffff;"> in</span> a 32-bit register
XADD Exchanges two values and stores the sum<span style="color: #00ffff;"> in</span> the destination operand
CMPXCHG Compares a value with an external value and exchanges it with another
CMPXCHG8B Compares two 64-bit values and exchanges it with another
</pre>


</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5">The Stack</h3>
<div class="outline-text-3" id="text-5-5">

<ul>
<li id="sec-5-5-1">How the stack works<br/>
The stack behaves just the opposite. The stack is reserved at the end of the memory area, and as data is
placed on the stack, it grows downward. 
</li>
</ul>
<ul>
<li id="sec-5-5-2">PUSHing and POPing all the registers<br/>



<pre class="src src-sh">PUSHA/POPA Push or pop all of the 16-bit general-purpose registers
PUSHAD/POPAD Push or pop all of the 32-bit general-purpose registers
PUSHF/POPF Push or pop the lower 16 bits of the EFLAGS register
PUSHFD/POPFD Push or pop the entire 32 bits of the EFLAGS register
</pre>

</li>
</ul>
<ul>
<li id="sec-5-5-3">Optimizing Memor y Access<br/>
To solve this problem, Intel suggests following these rules when defining data:

<ul>
<li>Align 16-bit data on a 16-byte boundary.
</li>
<li>Align 32-bit data so that its base address is a multiple of four.
</li>
<li>Align 64-bit data so that its base address is a multiple of eight.
</li>
<li>Avoid many small data transfers. Instead, use a single large data transfer.
</li>
<li>Avoid using larger data sizes (such as 80- and 128-bit
  floating-point values) in the stack
</li>
</ul>





</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Chapter 6: Controlling Execution Flow</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Unconditional Branches</h3>
<div class="outline-text-3" id="text-6-1">

<p>When an unconditional branch is encountered in the program, the instruction pointer is automatically
routed to a different location. You can use three types of unconditional branches:
❑ Jumps
❑ Calls
❑ Interrupts
</p></div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Conditional Branches</h3>
<div class="outline-text-3" id="text-6-2">

<p>The result of the conditional
branch depends on the state of the EFLAGS register at the time the branch is executed.
</p>
<p>
There are many bits in the EFLAGS register, but the conditional branches are only concerned with five
of them:
❑ Carry flag (CF) - bit 0 (lease significant bit)
❑ Overflow flag (OF) - bit 11
❑ Parity flag (PF) - bit 2
❑ Sign flag (SF) - bit 7
❑ Zero flag (ZF) - bit 6
</p>
<p>
The following table describes all of the conditional jump instructions
available.
</p>


<pre class="src src-sh">JA Jump if above <span style="color: #eedd82;">CF</span>=0 and <span style="color: #eedd82;">ZF</span>=0
JAE Jump if above or equal <span style="color: #eedd82;">CF</span>=0
JB Jump if below <span style="color: #eedd82;">CF</span>=1
JBE Jump if below or equal <span style="color: #eedd82;">CF</span>=1 or <span style="color: #eedd82;">ZF</span>=1
JC Jump if carry <span style="color: #eedd82;">CF</span>=1
JCXZ Jump if CX register is 0 JECXZ Jump if ECX register is 0 JE Jump if equal <span style="color: #eedd82;">ZF</span>=1
JG Jump if greater <span style="color: #eedd82;">ZF</span>=0 and <span style="color: #eedd82;">SF</span>=OF
JGE Jump if greater or equal <span style="color: #eedd82;">SF</span>=OF
JL Jump if less SF&lt;&gt;OF
JLE Jump if less or equal <span style="color: #eedd82;">ZF</span>=1 or SF&lt;&gt;OF
JNA Jump if not above <span style="color: #eedd82;">CF</span>=1 or <span style="color: #eedd82;">ZF</span>=1
JNAE Jump if not above or equal <span style="color: #eedd82;">CF</span>=1
JNB Jump if not below <span style="color: #eedd82;">CF</span>=0
JNBE Jump if not below or equal <span style="color: #eedd82;">CF</span>=0 and <span style="color: #eedd82;">ZF</span>=0
JNC Jump if not carry <span style="color: #eedd82;">CF</span>=0
JNE Jump if not equal <span style="color: #eedd82;">ZF</span>=0
JNG Jump if not greater <span style="color: #eedd82;">ZF</span>=1 or SF&lt;&gt;OF
JNGE Jump if not greater or equal SF&lt;&gt;OF
JNL Jump if not less <span style="color: #eedd82;">SF</span>=OF
JNLE Jump if not less or equal <span style="color: #eedd82;">ZF</span>=0 and <span style="color: #eedd82;">SF</span>=OF
JNO Jump if not overflow <span style="color: #eedd82;">OF</span>=0
JNP Jump if not parity <span style="color: #eedd82;">PF</span>=0
JNS Jump if not sign <span style="color: #eedd82;">SF</span>=0
JNZ Jump if not zero <span style="color: #eedd82;">ZF</span>=0
JO Jump if overflow <span style="color: #eedd82;">OF</span>=1
JP Jump if parity <span style="color: #eedd82;">PF</span>=1
JPE Jump if parity even <span style="color: #eedd82;">PF</span>=1
JPO Jump if parity odd <span style="color: #eedd82;">PF</span>=0
JS Jump if sign <span style="color: #eedd82;">SF</span>=1
JZ Jump if zero <span style="color: #eedd82;">ZF</span>=1
</pre>

<ul>
