src/Books Review/Professional Assembly Language/Professional Assembly Language.org
*** The compare instruction
The format of the CMP instruction is as follows:
=cmp operand1, operand2=
The CMP instruction compares the second operand with the first operand. It performs a subtraction oper-
ation on the two operands behind the scenes (operand2 – operand1). Neither of the operands is modi-
fied, but the EFLAGS register is set as if the subtraction took place.

Unlike the other flags, there are instructions that can specifically modify the carry flag. These are
described in the following table
#+begin_src sh
CLC Clear the carry flag (set it to zero)
CMC Complement the carry flag (change it to the opposite of what is set)
STC Set the carry flag (set it to one)
#+end_src


** Loops
#+begin_src sh
LOOP Loop until the ECX register is zero
LOOPE/LOOPZ Loop until either the ECX register is zero, or the ZF flag is not set
LOOPNE/LOOPNZ Loop until either the ECX register is zero, or the ZF flag is set
#+end_src
** Optimizing Branch Instructions

* Chapter 7: Using Numbers
** Using Numbers
 The core numeric data types are as follows:
❑ Unsigned integers
❑ Signed integers
❑ Binary-coded decimal
❑ Packed binary-coded decimal
❑ Single-precision floating-point
❑ Double-precision floating-point
❑ Double-extended floating-point
** Integers
*** Standard integer sizes
 The basic IA-32 platform supports four different integer sizes:
❑ Word: 16 bits
❑ Doubleword: 32 bits
❑ Byte: 8 bits
Quadword: 64 bits
*** Unsigned integers
#+begin_src sh
8 0 through 255
16 0 through 65,535
32 0 through 4,294,967,295
64 0 through 18,446,744,073,709,551,615
#+end_src
*** Signed integers
#+begin_src sh
❑ Signed magnitude
❑ One’s complement
❑ Two’s complement
#+end_src
he IA-32 platform uses the two’s complement method to represent
signed integers,

#+begin_src sh
8 -128 to 127
16 -32,768 to 32,767
32 -2,147,483,648 to 2,147,483,647
64 -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807
#+end_src








** Binary Coded Decimal
** Floating-Point Numbers
*** Standard floating-point data types
The IEEE Standard 754 floating-point standard defines real numbers as binary floating-point values
using three components:
❑ A sign
❑ A significand
❑ An exponent

The following table sums up the three types of floating-point formats used on the standard IA-32
platform.
#+begin_src sh
Single precision 32 24 8 1.18 x 10^-38 to
                        3.40 x 10^38
Double precision 64 53 11 2.23 x 10^-308 to
                         1.79 x 10^308
Double extended 80 64 15 3.37 x 10^-4932 to
                        1.18 x 10^4932
#+end_src
The IA-32 FLD instruction is used for loading single- and double-precision floating-point numbers stored
in memory onto the FPU register stack. To differentiate between the data sizes, the GNU assembler uses
the FLDS instruction for loading single-precision floating-point numbers, and the FLDL instruction for
loading double-precision floating-point numbers.

Similarly, the FST instruction is used for retrieving the top value on the FPU register stack and placing
the value in a memory location. Again, for single-precision numbers, the instruction is FSTS, and for
double-precision numbers, FSTL.
*** Using preset floating-point values
#+begin_src sh
FLD1 Push +1.0 into the FPU stack
FLDL2T Push log(base 2) 10 onto the FPU stack
FLDL2E Push log(base 2) e onto the FPU stack
FLDPI Push the value of pi onto the FPU stack
FLDLG2 Push log(base 10) 2 onto the FPU stack
FLDLN2 Push log(base e) 2 onto the FPU stack
FLDZ Push +0.0 onto the FPU stack
#+end_src
*** SSE floating-point data types
The following two new 128-bit floating-point data types are available:
❑ 128-bit packed single-precision floating-point (in SSE)
❑ 128-bit packed double-precision floating-point (in SSE2)
*** Moving SSE floating-point values
#+begin_src sh
MOVAPS Move four aligned, packed single-precision values to XMM
      registers or memory
MOVUPS Move four unaligned, packed single-precision values to XMM
      registers or memory
MOVSS Move a single-precision value to memory or the low doubleword
     of a register
MOVLPS Move two single-precision values to memory or the low
      quadword of a register
MOVHPS Move two single-precision values to memory or the high
      quadword of a register
MOVLHPS Move two single-precision values from the low quadword to
       the high quadword
MOVHLPS Move two single-precision values from the high quadword to
       the low quadword
#+end_src
*** SSE2 floating-point values
#+begin_src sh
MOVAPD Move two aligned, double-precision values to XMM registers
      or memory
MOVUPD Move two unaligned, double-precision values to XMM registers
      or memory
MOVSD Move one double-precision value to memory or the low
     quadword of a register
MOVHPD Move one double-precision value to memory or the high
      quadword of a register
MOVLPD Move one double-precision value to memory or the low
      quadword of a register
#+end_src

* Chapter 8: Basic Math Functions
** Integer Arithmetic
*** Addition
=add source, destination=

where source can be an immediate value, a memory location, or a register. The destination param-
eter can be either a register or a value stored in a memory location (although you cannot use a memory
location for both the source and destination at the same time). The result of the addition is placed in the
destination location.

The ADD instruction can add 8-, 16-, or 32-bit values. As with other GNU assembler instructions, you
must specify the size of the operands by adding a b (for byte), w (for word), or l (for doubleword) to the
end of the ADD mnemonic.

The ADC instruction can be used to add two unsigned or signed integer values, along with the value con-
tained in the carry flag from a previous ADD instruction. To add multiple groups of bytes, you can chain
together multiple ADC instructions, as the ADC instruction also sets the carry and overflow flags as appro-
priate for the operation.

The format of the ADC instruction is
=adc source, destination=
where source can be an immediate value or an 8-, 16-, or 32-bit register or memory location value, and
destination can be an 8-, 16-, or 32-bit register or memory location value. (Similar to the ADD instruc-
tion, source and destination cannot both be memory locations at one time).
