public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-6-2-1">The compare instruction<br/>
The format of the CMP instruction is as follows:
<code>cmp operand1, operand2</code>
The CMP instruction compares the second operand with the first operand. It performs a subtraction oper-
ation on the two operands behind the scenes (operand2 – operand1). Neither of the operands is modi-
fied, but the EFLAGS register is set as if the subtraction took place.

<p>
Unlike the other flags, there are instructions that can specifically modify the carry flag. These are
described in the following table
</p>


<pre class="src src-sh">CLC Clear the carry flag (<span style="color: #b0c4de;">set</span> it to zero)
CMC Complement the carry flag (change it to the opposite of what is set)
STC Set the carry flag (<span style="color: #b0c4de;">set</span> it to one)
</pre>



</li>
</ul>
</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">Loops</h3>
<div class="outline-text-3" id="text-6-3">




<pre class="src src-sh">LOOP Loop until the ECX register is zero
LOOPE/LOOPZ Loop until either the ECX register is zero, or the ZF flag is not set
LOOPNE/LOOPNZ Loop until either the ECX register is zero, or the ZF flag is set
</pre>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">Optimizing Branch Instructions</h3>
<div class="outline-text-3" id="text-6-4">


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Chapter 7: Using Numbers</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">Using Numbers</h3>
<div class="outline-text-3" id="text-7-1">

<p> The core numeric data types are as follows:
❑ Unsigned integers
❑ Signed integers
❑ Binary-coded decimal
❑ Packed binary-coded decimal
❑ Single-precision floating-point
❑ Double-precision floating-point
❑ Double-extended floating-point
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">Integers</h3>
<div class="outline-text-3" id="text-7-2">

<ul>
<li id="sec-7-2-1">Standard integer sizes<br/>
 The basic IA-32 platform supports four different integer sizes:
❑ Word: 16 bits
❑ Doubleword: 32 bits
❑ Byte: 8 bits
Quadword: 64 bits
</li>
</ul>
<ul>
<li id="sec-7-2-2">Unsigned integers<br/>



<pre class="src src-sh">8 0 through 255
16 0 through 65,535
32 0 through 4,294,967,295
64 0 through 18,446,744,073,709,551,615
</pre>

</li>
</ul>
<ul>
<li id="sec-7-2-3">Signed integers<br/>



<pre class="src src-sh">&#10065; Signed magnitude
&#10065; One&#8217;s complement
&#10065; Two&#8217;s complement
</pre>

<p>
he IA-32 platform uses the two’s complement method to represent
signed integers,
</p>



<pre class="src src-sh">8 -128 to 127
16 -32,768 to 32,767
32 -2,147,483,648 to 2,147,483,647
64 -9,223,372,036,854,775,808 to 9,223,372,036,854,775,807
</pre>









</li>
</ul>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">Binary Coded Decimal</h3>
<div class="outline-text-3" id="text-7-3">

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">Floating-Point Numbers</h3>
<div class="outline-text-3" id="text-7-4">

<ul>
<li id="sec-7-4-1">Standard floating-point data types<br/>
The IEEE Standard 754 floating-point standard defines real numbers as binary floating-point values
using three components:
❑ A sign
❑ A significand
❑ An exponent

<p>
The following table sums up the three types of floating-point formats used on the standard IA-32
platform.
</p>


<pre class="src src-sh">Single precision 32 24 8 1.18 x 10^-38 to
                        3.40 x 10^38
Double precision 64 53 11 2.23 x 10^-308 to
                         1.79 x 10^308
Double extended 80 64 15 3.37 x 10^-4932 to
                        1.18 x 10^4932
</pre>

<p>
The IA-32 FLD instruction is used for loading single- and double-precision floating-point numbers stored
in memory onto the FPU register stack. To differentiate between the data sizes, the GNU assembler uses
the FLDS instruction for loading single-precision floating-point numbers, and the FLDL instruction for
loading double-precision floating-point numbers.
</p>
<p>
Similarly, the FST instruction is used for retrieving the top value on the FPU register stack and placing
the value in a memory location. Again, for single-precision numbers, the instruction is FSTS, and for
double-precision numbers, FSTL.
</p></li>
</ul>
<ul>
<li id="sec-7-4-2">Using preset floating-point values<br/>



<pre class="src src-sh">FLD1 Push +1.0 into the FPU stack
FLDL2T Push log(base 2) 10 onto the FPU stack
FLDL2E Push log(base 2) e onto the FPU stack
FLDPI Push the value of pi onto the FPU stack
FLDLG2 Push log(base 10) 2 onto the FPU stack
FLDLN2 Push log(base e) 2 onto the FPU stack
FLDZ Push +0.0 onto the FPU stack
</pre>

</li>
</ul>
<ul>
<li id="sec-7-4-3">SSE floating-point data types<br/>
The following two new 128-bit floating-point data types are available:
❑ 128-bit packed single-precision floating-point (in SSE)
❑ 128-bit packed double-precision floating-point (in SSE2)
</li>
</ul>
<ul>
<li id="sec-7-4-4">Moving SSE floating-point values<br/>



<pre class="src src-sh">MOVAPS Move four aligned, packed single-precision values to XMM
      registers or memory
MOVUPS Move four unaligned, packed single-precision values to XMM
      registers or memory
MOVSS Move a single-precision value to memory or the low doubleword
     of a register
MOVLPS Move two single-precision values to memory or the low
      quadword of a register
MOVHPS Move two single-precision values to memory or the high
      quadword of a register
MOVLHPS Move two single-precision values from the low quadword to
       the high quadword
MOVHLPS Move two single-precision values from the high quadword to
       the low quadword
</pre>

</li>
</ul>
<ul>
<li id="sec-7-4-5">SSE2 floating-point values<br/>



<pre class="src src-sh">MOVAPD Move two aligned, double-precision values to XMM registers
      or memory
MOVUPD Move two unaligned, double-precision values to XMM registers
      or memory
MOVSD Move one double-precision value to memory or the low
     quadword of a register
MOVHPD Move one double-precision value to memory or the high
      quadword of a register
MOVLPD Move one double-precision value to memory or the low
      quadword of a register
</pre>


</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Chapter 8: Basic Math Functions</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Integer Arithmetic</h3>
<div class="outline-text-3" id="text-8-1">

<ul>
<li id="sec-8-1-1">Addition<br/>
<code>add source, destination</code>

<p>
where source can be an immediate value, a memory location, or a register. The destination param-
eter can be either a register or a value stored in a memory location (although you cannot use a memory
location for both the source and destination at the same time). The result of the addition is placed in the
destination location.
</p>
<p>
The ADD instruction can add 8-, 16-, or 32-bit values. As with other GNU assembler instructions, you
must specify the size of the operands by adding a b (for byte), w (for word), or l (for doubleword) to the
end of the ADD mnemonic.
</p>
<p>
The ADC instruction can be used to add two unsigned or signed integer values, along with the value con-
tained in the carry flag from a previous ADD instruction. To add multiple groups of bytes, you can chain
together multiple ADC instructions, as the ADC instruction also sets the carry and overflow flags as appro-
priate for the operation.
</p>
<p>
The format of the ADC instruction is
<code>adc source, destination</code>
where source can be an immediate value or an 8-, 16-, or 32-bit register or memory location value, and
destination can be an 8-, 16-, or 32-bit register or memory location value. (Similar to the ADD instruc-
tion, source and destination cannot both be memory locations at one time).
</p></li>
</ul>
<ul>
<li id="sec-8-1-2">Subtraction<br/>
