public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
The format of the SUB instruction is
<code>sub source, destination</code>
where the source value is subtracted from the destination value, with the result stored in the
destination operand location. The source and destination operands can
be 8-, 16-, or 32-bit registers or values stored in memory (but again, they cannot both be memory locations at the same time). The
source value can also be an immediate data value.

<p>
Just like in addition, you can use the carry condition to your advantage to subtract large signed integer
values. The SBB instruction utilizes the carry and overflow flags in multibyte subtractions to implement
the borrow feature across data boundaries.
The format of the SBB instruction is
<code>sbb source, destination</code>
where the carry bit is added to the source value, and the result is subtracted from the destination
value. The result is stored in the destination location
</p></li>
</ul>
<ul>
<li id="sec-8-1-3">Incrementing and decrementing<br/>
The format of the instructions is
<code>dec destination</code>
<code>inc destination</code>
</li>
</ul>
<ul>
<li id="sec-8-1-4">Multiplication<br/>
he format for the MUL instruction is
<code>mul source</code>
where source can be an 8-, 16-, or 32-bit register or memory value. You might be wondering how you
can multiply two values by only supplying one operand in the instruction line. The answer is that the
destination operand is implied.

<p>
Working with the implied destination operand is somewhat complicated. For one thing, the destination
location always uses some form of the EAX register, depending on the size of the source operand. Thus,
one of the operands used in the multiplication must be placed in the AL, AX, or EAX registers, depending
on the size of the value.
</p>
<p>
Unfortunately, when multiplying a 16-bit source operand, the EAX register is not used to hold the 32-bit
result. In order to be backwardly compatible with older processors, Intel uses the DX:AX register pair to
hold the 32-bit multiplication result value (this format started back in the 16-bit processor days). The
high-order word of the result is stored in the DX register, while the low-order word is stored in the AX
register.
</p>
<p>
For 32-bit source values, the 64-bit EDX:EAX register pair is used, again with the high-order doubleword
in the EDX register, and the low-order doubleword in the EAX. Make sure that if you have data stored in
the EDX (or DX) register that you save it elsewhere when using the 16- or 32-bit versions of MUL.
</p>


<pre class="src src-sh">8 bits AL AX
16 bits AX DX:AX
32 bits EAX EDX:EAX
</pre>


<p>
The first format of the IMUL instruction takes one operand, and behaves exactly the same as the MUL
instruction:
<code>imul source</code>
</p>
<p>
The second format of the IMUL instruction enables you to specify a destination operand other than the
EAX register:
<code>imul source, destination</code>
where source can be a 16- or 32-bit register or value in memory, and destination must be a 16- or
32-bit general-purpose register. This format enables you to specify where the result of the multiplication
will go (instead of being forced to use the AX and DX registers).
</p>
<p>
he third format of the IMUL instruction enables you to specify three operands:
<code>imul multiplier, source, destination</code>
where multiplier is an immediate value, source is a 16- or 32-bit register or value in memory, and
destination must be a general-purpose register. This format enables you to perform a quick multi-
plication of a value (the source) with a signed integer (the multiplier), storing the result in a general-
purpose register (the destination).
</p></li>
</ul>
<ul>
<li id="sec-8-1-5">Division<br/>
<ul>
<li id="sec-8-1-5-1">Unsigned division<br/>
The DIV instruction is used for dividing unsigned integers. The format of the DIV instruction is
<code>div divisor</code>

<p>
where divisor is the value that is divided into the implied dividend, and can be an 8-, 16-, or 32-bit reg-
ister or value in memory. The dividend must already be stored in the AX register (for a 16-bit value), the
DX:AX register pair (for a 32-bit value), or the EDX:EAX register pair (for a 64-bit value) before the DIV
instruction is performed.
</p>



<pre class="src src-sh">AX 16 bits AL AH
DX:AX 32 bits AX DX
EDX:EAX 64 bits EAX EDX
</pre>


</li>
</ul>
<ul>
<li id="sec-8-1-5-2">Signed division<br/>
The IDIV instruction is used exactly like the DIV instruction, but for dividing signed integers. It too uses
an implied dividend, located in the AX register, the DX:AX register pair, or the EDX:EAX register pair.
Unlike the IMUL instruction, there is only one format for the IDIV instruction, which specifies the divisor
used in the division:
<code>idiv divisor</code>





</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-8-1-6">Shift Instructions<br/>
<ul>
<li id="sec-8-1-6-1">Multiply by shifting<br/>
To multiply integers by a power of 2, you must shift the value to the left. Two instructions can be used to
left shift integer values, SAL (shift arithmetic left) and SHL (shift logical left). Both of these instructions
perform the same operation, and are interchangeable. They have three different formats:



<pre class="src src-sh">sal destination
sal %cl, destination
sal shifter, destination
</pre>

<p>
The first format shifts the destination value left one position, which is the equivalent of multiplying
the value by 2.
</p>
<p>
The second format shifts the destination value left by the number of
times specified in the CL register.
</p>
<p>
The final version shifts the destination value left the number of
times indicated by the shifter value.
</p></li>
</ul>
<ul>
<li id="sec-8-1-6-2">Dividing by shifting<br/>
The SHR instruction clears the bits emptied
by the shift, which makes it useful only for shifting unsigned integers. The SAR instruction either clears
or sets the bits emptied by the shift, depending on the sign bit of the integer. For negative numbers, the
bits are set to 1, but for positive numbers, they are cleared to zero.
</li>
</ul>
<ul>
<li id="sec-8-1-6-3">Rotating bits<br/>



<pre class="src src-sh">ROL Rotate value left
ROR Rotate value right
RCL Rotate left and include carry flag
RCR Rotate right and include carry flag
</pre>

</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-8-1-7">Logical Operations<br/>
<ul>
<li id="sec-8-1-7-1">Boolean logic<br/>
When working with binary numbers, it is handy to have the standard Boolean logic functions available.
The following Boolean logic operations are provided:
❑ AND
❑ NOT
❑ OR
❑ XOR

<p>
The AND, OR, and XOR instructions use the same format:
and source, destination
</p></li>
</ul>
<ul>
<li id="sec-8-1-7-2">Bit testing<br/>
The format of the TEST instruction is the same as for the AND instruction. Even though no data is written
to the destination location, you still must specify any immediate values as the source value. This is simi-
lar to how the CMP instruction works like the SUB instruction, but it does not store the result anywhere.

<p>
As mentioned, the most common use of the TEST instruction is to check for flags in the EFLAGS register.
</p>




</li>
</ul>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Chapter 15: Optimizing Routines</h2>
<div class="outline-text-2" id="text-9">

<p>However, just writing functions in assembly language code instead of C or C++ does not necessarily
make them perform better. Remember, the GNU compiler already converts all of your high-level
language code to assembly language, so writing a function in assembly language just means that
you did it instead of the compiler.
</p>
</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Optimized Compiler Code</h3>
<div class="outline-text-3" id="text-9-1">

<p>The -O family of compiler options provides steps of optimization for the GNU compiler. Each step provides
a higher level of optimization. There are currently three steps available for optimizing:
</p>
<p>
❑ -O: Provides a basic level of optimization
❑ -O2: Provides more advanced code optimization
❑ -O3: Provides the highest level of optimization
</p>
<p>
Each individual optimization technique can be referenced using the -f command-
line option. The -O options bundle various -f options together in a single option.
</p><ul>
