public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-9-1-1">Compiler optimization level 1<br/>
The -f optimization functions included at this level are described in
the following list:




<pre class="src src-sh">&#10065; -fdefer-pop: This optimization technique is related to how the assembly language code acts when
a <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">is</span> finished. Normally, input values for functions are placed on the stack and accessed
by the function. When the <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">returns</span>, the input values are still on the stack. Normally, the
input values are popped from the stack immediately following the <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">return.</span>
This option permits the compiler to allow input values to accumulate on the stack across func-
tion calls. The accumulated input values are then removed all at once with a single instruction
(usually by changing the stack pointer to the proper value). For most operations this is perfectly
legal, as input values for new functions are placed on top of the old input values. However, this
does make things somewhat messy on the stack.

&#10065; -fthread-jumps: This optimization technique relates to how the compiler handles both condi-
       tional and unconditional branches<span style="color: #00ffff;"> in</span> the assembly code. In some cases, one jump instruction
      may lead to another conditional branch statement. By threading jumps, the compiler determines
     the final destination between multiple jumps and redirects the first jump to the final destination.

&#10065; -fmerge-constants: With this optimization technique, the compiler attempts to merge identical
constants. This feature can sometimes result<span style="color: #00ffff;"> in</span> long compile times, as the compiler must analyze
every constant used<span style="color: #00ffff;"> in</span> the C or C++ program, comparing them with one another.

&#10065; -floop-optimize: By optimizing how loops are generated<span style="color: #00ffff;"> in</span> the assembly language, the com-
piler can greatly increase the performance of the application. Often, programs consist of many
loops that are large and complex. By removing variable assignments that do not change value
within the loops, the number of instructions performed within the loop can be reduced, greatly improving performance. In addition, any conditional branches made to determine when to
leave the loop are optimized to reduce the effects of the branching.

&#10065; -fif-conversion: Next to loops, if-then statements are the second most time-consuming part of
   an application. A simple if-then statement can generate numerous conditional branches<span style="color: #00ffff;"> in</span> the
  final assembly language code. By reducing or eliminating conditional branches and replacing
 them with conditional moves, setting flags, and performing arithmetic tricks, the compiler can
reduce the amount of time spent<span style="color: #00ffff;"> in</span> the if-then statements.

&#10065; -fif-conversion2: This technique incorporates more advanced mathematical features that reduce
   the conditional branching required to implement the if-then statements.

&#10065; -fdelayed-branch: This technique attempts to reorder instructions based on instruction cycle
   times. It also attempts to move as many instructions before conditional branches as possible to
  maximize the use of the processor instruction cache.

&#10065; -fguess-branch-probability: As its name suggests, this technique attempts to determine the
   most likely outcome of conditional branches, and moves instructions accordingly, similar to the
  delayed-branch technique. Because the code placement is predicted at compile time, it is quite
 possible that compiling the same C or C++ code twice using this option can produce different
assembly language source code, depending on what branches the compiler thought would be
used at compile time.
Because of this, many programmers prefer not to incorporate this feature, and specifically
include the &#8211;fno-guess-branch-probability option to turn it off.

&#10065; -fcprop-registers: As registers are allocated to variables within functions, the compiler performs
a second pass to reduce scheduling dependencies (two sections requiring the same register) and
eliminate needlessly copying registers.
</pre>


</li>
</ul>
<ul>
