src/Books Review/Professional Assembly Language/Professional Assembly Language.org
*** Compiler optimization level 2
The second level of code optimization (-O2) incorporates all of the optimization techniques of the first
level, plus a lot of additional techniques. These techniques are related to more specific types of code,
such as loops and conditional branches. If the basic assembly language code generated by the compiler
does not utilize the type of code analyzed in this level, no additional optimization will be performed.
The following list describes the additional -f optimization options that are attempted at this level.
#+begin_src sh
❑ -fforce-mem: This optimization forces all variables stored in memory locations to be copied to
   registers before using them in any instructions. For variables that are only involved in a single
  instruction, this may not be much of an optimization. However, for variables that are involved
 in a lot of instructions (such as mathematical operations), this can be a huge optimization, as the
processor can access the value in a register much quicker than in memory.
❑ -foptimize-sibling-calls: This technique deals with function calls that are related and/or recur-
   sive. Often, recursive function calls can be unrolled into a common string of instructions, rather
  than using branching. This enables the processor instruction cache to load the unrolled instruc-
 tions and process them faster than if they remain as separate function calls requiring branching.
❑ -fstrength-reduce: This optimization technique performs loop optimization and eliminates itera-
   tion variables. Iteration variables are variables that are tied to loop counters, such as for-next loops
  that use a variable and then perform mathematical operations using the loop counter variable.

❑
-fgcse: This performs Global Common Subexpression Elimination (gcse) routines on all of the
generated assembly language code. These optimizations attempt to analyze the generated
assembly language code and combine common pieces, eliminating redundant code segments.
It should be noted that the gcc instructions recommend using –fno-gcse if the code uses
computed gotos.
❑ ❑ -frerun-cse-after-loop: This technique reruns the Common Subexpression Elimination routines
       after any loops have been optimized. This enables loop code to be further optimized after it has
      been unrolled.
❑ -fdelete-null-pointer-checks: This optimization technique scans the generated assembly language
   code for code that checks for null pointers. The compiler assumes that dereferencing a null pointer
  would halt the program. If a pointer is checked after it has been dereferenced, it cannot be null.
❑ -fexpensive-optimizations: This performs various optimization techniques that are expensive
   from a compile-time point of view, but it can have a negative effect on runtime performance.
❑ -fregmove: The compiler will attempt to reassign registers used in MOV instructions and as
   operands of other instructions in order to maximize the amount of register tying.
❑ -fschedule-insns: The compiler will attempt to reorder instructions in order to eliminate proces-
   sor waits for data. For processors that have delays associated with floating-point arithmetic, this
  enables the processor to load other instructions while it waits for the floating-point results.
❑ -fsched-interblock: This technique enables the compiler to schedule instructions across blocks
   of instructions. This provides greater flexibility in moving instructions around to maximize
  work done during wait times.
❑ -fcaller-saves: This option instructs the compiler to save and restore registers around function
   calls to enable the functions to clobber register values without having to save and restore them.
  This can be a time-saver if multiple functions are called because the registers are saved and
 restored only once, instead of within each function call.
❑ -fpeephole2: This option enables any machine-specific peephole optimizations.
❑ -freorder-blocks: This optimization technique enables blocks of instructions to be reordered to
   improve branching and code locality.
❑ -fstrict-aliasing: This technique enforces strict variable rules for the higher-level language. For C
   and C++ programs, it ensures that variables are not shared between data types. For example, an
  integer variable cannot use the same memory location as a single-precision floating-point variable.
❑ -funit-at-a-time: This optimization technique instructs the compiler to read the entire assembly
   language code before running the optimization routines. This enables the compiler to reorder
  non-time-sensitive code to optimize the instruction cache. However, it takes considerably more
 memory during compile time, which may be a problem for smaller machines.
❑ -fcse-follow-jumps: This particular Common Subexpression Elimination (cse) technique
scans through a jump instruction looking for destination code that is not reached via any other
means within the program. The most common example of this is the else part of if-then-
else statements.

-falign-functions: This option is used to align functions at the start of a specific boundary in
memory. Most processors read memory in pages, and enabling an entire function code to reside
in a single page can improve performance. If a function crosses pages, another page of memory
must be processed to complete the function.

❑ -falign-loops: Similar to aligning functions, loops that contain code that is processed multiple times
   can benefit from being aligned within a page boundary in memory. When the loop is processed, if it
  is contained within a single memory page, no swapping of pages is required for the code.
❑ -fcrossjumping: The process of cross-jumping transforms code to combine equivalent code
   scattered throughout the program. This saves code size, but it may not have a direct impact on
  program performance.

#+end_src
