public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-9-1-2">Compiler optimization level 2<br/>
The second level of code optimization (-O2) incorporates all of the optimization techniques of the first
level, plus a lot of additional techniques. These techniques are related to more specific types of code,
such as loops and conditional branches. If the basic assembly language code generated by the compiler
does not utilize the type of code analyzed in this level, no additional optimization will be performed.
The following list describes the additional -f optimization options that are attempted at this level.



<pre class="src src-sh">&#10065; -fforce-mem: This optimization forces all variables stored<span style="color: #00ffff;"> in</span> memory locations to be copied to
   registers before using them<span style="color: #00ffff;"> in</span> any instructions. For variables that are only involved<span style="color: #00ffff;"> in</span> a single
  instruction, this may not be much of an optimization. However, for variables that are involved
 <span style="color: #00ffff;">in</span> a lot of instructions (such as mathematical operations), this can be a huge optimization, as the
processor can access the value<span style="color: #00ffff;"> in</span> a register much quicker than<span style="color: #00ffff;"> in</span> memory.
&#10065; -foptimize-sibling-calls: This technique deals with <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">calls</span> that are related and/or recur-
   sive. Often, recursive <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">calls</span> can be unrolled into a common string of instructions, rather
  than using branching. This enables the processor instruction cache to load the unrolled instruc-
 tions and process them faster than if they remain as separate <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">calls</span> requiring branching.
&#10065; -fstrength-reduce: This optimization technique performs loop optimization and eliminates itera-
   tion variables. Iteration variables are variables that are tied to loop counters, such as for-next loops
  that use a variable and then perform mathematical operations using the loop counter variable.

&#10065;
-fgcse: This performs Global Common Subexpression Elimination (gcse) routines on all of the
generated assembly language code. These optimizations attempt to analyze the generated
assembly language code and combine common pieces, eliminating redundant code segments.
It should be noted that the gcc instructions recommend using &#8211;fno-gcse if the code uses
computed gotos.
&#10065; &#10065; -frerun-cse-after-loop: This technique reruns the Common Subexpression Elimination routines
       after any loops have been optimized. This enables loop code to be further optimized after it has
      been unrolled.
&#10065; -fdelete-null-pointer-checks: This optimization technique scans the generated assembly language
   code for code that checks for null pointers. The compiler assumes that dereferencing a null pointer
  would halt the program. If a pointer is checked after it has been dereferenced, it cannot be null.
&#10065; -fexpensive-optimizations: This performs various optimization techniques that are expensive
   from a compile-time point of view, but it can have a negative effect on runtime performance.
&#10065; -fregmove: The compiler will attempt to reassign registers used<span style="color: #00ffff;"> in</span> MOV instructions and as
   operands of other instructions<span style="color: #00ffff;"> in</span> order to maximize the amount of register tying.
&#10065; -fschedule-insns: The compiler will attempt to reorder instructions<span style="color: #00ffff;"> in</span> order to eliminate proces-
   sor waits for data. For processors that have delays associated with floating-point arithmetic, this
  enables the processor to load other instructions while it waits for the floating-point results.
&#10065; -fsched-interblock: This technique enables the compiler to schedule instructions across blocks
   of instructions. This provides greater flexibility<span style="color: #00ffff;"> in</span> moving instructions around to maximize
  work done during wait times.
&#10065; -fcaller-saves: This option instructs the compiler to save and restore registers around <span style="color: #00ffff;">function</span>
   calls to enable the functions to clobber register values without having to save and restore them.
  This can be a time-saver if multiple functions are called because the registers are saved and
 restored only once, instead of within each <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">call.</span>
&#10065; -fpeephole2: This option enables any machine-specific peephole optimizations.
&#10065; -freorder-blocks: This optimization technique enables blocks of instructions to be reordered to
   improve branching and code locality.
&#10065; -fstrict-aliasing: This technique enforces strict variable rules for the higher-level language. For C
   and C++ programs, it ensures that variables are not shared between data types. For example, an
  <span style="color: #b0c4de;">integer</span> variable cannot use the same memory location as a single-precision floating-point variable.
&#10065; -funit-at-a-time: This optimization technique instructs the compiler to read the entire assembly
   language code before running the optimization routines. This enables the compiler to reorder
  non-time-sensitive code to optimize the instruction cache. However, it takes considerably more
 memory during compile time, which may be a problem for smaller machines.
&#10065; -fcse-follow-jumps: This particular Common Subexpression Elimination (cse) technique
scans through a jump instruction looking for destination code that is not reached via any other
means within the program. The most common example of this is the else part of if-then-
<span style="color: #00ffff;">else</span> statements.

-falign-functions: This option is used to align functions at the start of a specific boundary<span style="color: #00ffff;"> in</span>
memory. Most processors read memory<span style="color: #00ffff;"> in</span> pages, and enabling an entire <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">code</span> to reside
<span style="color: #00ffff;">in</span> a single page can improve performance. If a <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">crosses</span> pages, another page of memory
must be processed to complete the function.

&#10065; -falign-loops: Similar to aligning functions, loops that contain code that is processed multiple times
   can benefit from being aligned within a page boundary<span style="color: #00ffff;"> in</span> memory. When the loop is processed, if it
  is contained within a single memory page, no swapping of pages is required for the code.
&#10065; -fcrossjumping: The process of cross-jumping transforms code to combine equivalent code
   scattered throughout the program. This saves code size, but it may not have a direct impact on
  program performance.

</pre>

</li>
</ul>
<ul>
