src/Books Review/Professional Assembly Language/Professional Assembly Language.org
*** Compiler optimization level 3
The highest level of optimization provided by the compiler is accessed using the -O3 option. It incorpo-
rates all of the optimization techniques listed in levels one and two, along with some very specific addi-
tional optimizations. Again, there is no guarantee that this level of optimization will improve performance
of the final code. The following -f optimization options are included at this level:
#+begin_src sh
❑ -finline-functions: Instead of creating separate assembly language code for functions, this opti-
   mization technique includes the function code within the code from the calling program. For func-
  tions that are called multiple times, the function code is duplicated for each function call. While
 this may not be good for code size, it can increase performance by maximizing the instruction
cache code usage, instead of branching on each function call.
❑ -fweb: This constructs a web of pseudo-registers to hold variables. The pseudo-registers contain
   data as if they were registers, but can be optimized by the various other optimization techniques,
  such as cse and loop optimizing.
❑ -fgcse-after-reload: This technique performs a second gcse optimization after completely
   reloading the generated and optimized assembly language code. This helps eliminate any
  redundant sections created by the different optimization passes.
#+end_src


