public_html/Books Review/Professional Assembly Language/Professional Assembly Language.html
<li id="sec-9-1-3">Compiler optimization level 3<br/>
The highest level of optimization provided by the compiler is accessed using the -O3 option. It incorpo-
rates all of the optimization techniques listed in levels one and two, along with some very specific addi-
tional optimizations. Again, there is no guarantee that this level of optimization will improve performance
of the final code. The following -f optimization options are included at this level:



<pre class="src src-sh">&#10065; -finline-functions: Instead of creating separate assembly language code for functions, this opti-
   mization technique includes the <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">code</span> within the code from the calling program. For func-
  tions that are called multiple times, the <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">code</span> is duplicated for each <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">call.</span> While
 this may not be good for code size, it can increase performance by maximizing the instruction
cache code usage, instead of branching on each <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">call.</span>
&#10065; -fweb: This constructs a web of pseudo-registers to hold variables. The pseudo-registers contain
   data as if they were registers, but can be optimized by the various other optimization techniques,
  such as cse and loop optimizing.
&#10065; -fgcse-after-reload: This technique performs a second gcse optimization after completely
   reloading the generated and optimized assembly language code. This helps eliminate any
  redundant sections created by the different optimization passes.
</pre>



</li>
</ul>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-30T22:32+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
